In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  9  4  9  6
1  7  8  2  1  1
2  5  9  7  7  7
3  4  7  5  3  8
4  3  6  1  5  9

In [3]:
df.loc[:, ::-1]

   E  D  C  B  A
0  6  9  4  9  4
1  1  1  2  8  7
2  7  7  7  9  5
3  8  3  5  7  4
4  9  5  1  6  3

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  3  6  1  5  9
3  4  7  5  3  8
2  5  9  7  7  7
1  7  8  2  1  1
0  4  9  4  9  6

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  3  6  1  5  9
1  4  7  5  3  8
2  5  9  7  7  7
3  7  8  2  1  1
4  4  9  4  9  6

#06: Mengganti nama (label) kolom pada Data Frame

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [7]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  1  3  6  1  3
1  2  5  9  3  5
2  1  9  8  7  4
3  3  5  1  3  4
4  6  4  8  4  8

In [8]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  1  3     6  1  3
1  2  5     9  3  5
2  1  9     8  7  4
3  3  5     1  3  4
4  6  4     8  4  8

In [9]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     1       3  6     1  3
1     2       5  9     3  5
2     1       9  8     7  4
3     3       5  1     3  4
4     6       4  8     4  8


#07: Menghapus (drop) missing values (NaN)

In [10]:
import pandas as pd

print(pd.__version__)

2.3.3

In [11]:
## DEPRICATED ##
# df = pd.util.testing.makeMissingDataframe().reset_index() 
# df.head()

In [12]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0       NaN  0.974195  0.192587       NaN
1      1 -0.495686  1.457886  1.636556 -0.513776
2      2       NaN -0.890610  1.546203  2.242480
3      3  1.662946  2.052911  0.270666 -0.215590
4      4  0.024166       NaN -1.355858 -0.484384

In [13]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0       NaN  0.974195  0.192587       NaN
1  1 -0.495686  1.457886  1.636556 -0.513776
2  2       NaN -0.890610  1.546203  2.242480
3  3  1.662946  2.052911  0.270666 -0.215590
4  4  0.024166       NaN -1.355858 -0.484384

In [14]:
df_backup = df.copy(deep=True)

In [15]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

     Z         A         B         C         D
1    1 -0.495686  1.457886  1.636556 -0.513776
3    3  1.662946  2.052911  0.270666 -0.215590
5    5  0.449983  1.405586  0.646473 -0.127944
7    7  0.338015 -0.152241 -0.753161 -0.493561
12  12 -1.988118  1.413285  1.233180 -1.349799

In [16]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.366667
B    0.266667
C    0.166667
D    0.133333
dtype: float64

In [17]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z
0  0
1  1
2  2
3  3
4  4


#08: Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame

In [18]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [19]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [20]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [21]:
type(df['A'])

pandas.core.series.Series

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [24]:
df['A'].equals(df['B'])

True

In [25]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [26]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True